import 'package:flutter/material.dart';
import 'package:logic_study/theme/colors.dart';

import 'tearms_and_condition.dart';

const black = Colors.black;
const primary = AppColors.primary;

class AboutPage extends StatelessWidget {
  const AboutPage({super.key});

  @override
  Widget build(BuildContext context) {
    return LayoutBuilder(builder: (context, size) {
      return SizedBox(
        height: size.maxHeight,
        child: ListView(
          children: const [
            SizedBox(height: 20),
            TextContent(null,
                'مرحبًا بك في منصة شمسية الإلكترونية للتنمية المستدامة،نقدم لك فرصة استثنائية للتعلم والنمو الشخصي من خلال مجموعة متنوعة من الكورسات العالية الجودة. سواء كنت تبحث عن تطوير مهارات جديدة أو تحسين جوانبك الشخصية والمهنية، فإننا نقدم لك أدوات التعلم الفعّالة والتوجيه الخبير لتحقيق أهدافك.'),
            TextContent('تنوع الكورسات والمحتوى',
                'تتميز المنصة بتقديم مجموعة متنوعة من الكورسات والمحتوى التعليمي، تشمل مختلف المجالات والمهارات. سواء كنت تهتم بتطوير مهارات تقنية، أو إتقان مهارات إدارة الأعمال، أو حتى تعزيز جوانبك الشخصية والتنمية الذاتية، ستجد ما يناسب اهتماماتك واحتياجاتك على المنصة.'),
            TextContent('تجربة تعلم مرنة وملائمة',
                'تمكّنك المنصة من تعلم المهارات والمفاهيم وفقًا لجدولك الشخصي ومن أي مكان تفضل. يمكنك الوصول إلى محتوى الكورسات عبر الإنترنت في أوقات تناسبك، مما يتيح لك الفرصة لمتابعة تطويرك بغض النظر عن جدولك اليومي.'),
            TextContent('تفاعل وتواصل مع المحتوى والمدربين',
                'تتيح المنصة لك التفاعل المباشر مع المحتوى من خلال مقاطع الفيديو التفاعلية والنشاطات التفاعلية. بالإضافة إلى ذلك، يمكنك التواصل مع مدربين ذوي خبرة والحصول على توجيه شخصي وإجابة على استفساراتك واحتياجاتك التعليمية.'),
            TextContent('الاهداف العملية',
                'خلق قطاع تنموي في السوق العراقي بث روح التنمية والعمل في تكوين القدرات المهارية للشباب تحويل العناصر البشرية الخاملة الى عناصر منتجة اعداد اسر منتجة قادرة على العمل من داخل المنازل تطوير القدرات الابداعية للشباب في العمل والانتاج تفعيل التبادل التجاري الدولي مع العراق من خلال تصدير الموارد التي ينفرد بها العراق انشاء منظومة رقمية تهتم بالتنمية المستدامة في دوائر الدولة'),
            TextContent('الاهداف الاستراتيجية',
                'حصر الشباب العراقي ضمن دوائر عقائدية عقلية تنفذ الاتجاه الواحد القضاء على التشتت الفكري وخلق قاعدة فكرية ضمن نطاق القدوة خلق مجتمع عملي يواكب التطورات العصرية تنمية قطاع الاعمال ضمن مبادرة موحدة ( ريادة الاعمال ) انشاء حاضنة سياسية موحدة للشباب التنموي ( جمهرة الطاقات المبدعة المستقبلي )'),
            TextContent('النتائج الفعلية لعمل المنصة',
                'استقطاب و توجية المتدرب الى اختصاصة المنتج تدريب و تطوير و تأهيل وتشغيل وادامة تشغيل المتدرب في سوق العمل'),
          ],
        ),
      );
    });
  }
}
